package queue.code.getmaxwindow;

/**
 *          生成窗口最大值数组(❤❤)
 *
 *  题目：
 *      有一个整型数组arr和一个大小为w的窗口从数组的最左边滑到最右边，窗口每次向
 *      右边滑动一个位置。
 *
 *      例如，数组为[4,3,5,4,3,3,6,7]，窗口大小为3时：
 *
 *      [4  3   5]  4   3   3   6   7           窗口中最大值为5
 *      [4  3   5]  4   3   3   6   7           窗口中最大值为5
 *      [4  3   5]  4   3   3   6   7           窗口中最大值为5
 *      [4  3   5]  4   3   3   6   7           窗口中最大值为5
 *      [4  3   5]  4   3   3   6   7           窗口中最大值为5
 *      [4  3   5]  4   3   3   6   7           窗口中最大值为5
 *
 *
 */

public class MaxWindow {
}
